[
  "A member of your group gets MVP in 5 PvP battles.",
  "Achieve victory at 10 Easy Rebel Camps or Bandit Raids.",
  "Achieve victory at 10 Hard Rebel Camps or Bandit Raids.",
  "Achieve victory at 10 Medium Rebel Camps or Bandit Raids.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty using Chevaliers.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty using Fire Lancers.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty using Houndsmen.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty using Liao's Rangers.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty using Siphoinarioi.",
  "Achieve victory at 10 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 12 Easy Rebel Camps or Bandit Raids.",
  "Achieve victory at 12 Medium Rebel Camps or Bandit Raids.",
  "Achieve victory at 12 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 4 Easy Rebel Camps or Bandit Raids.",
  "Achieve victory at 4 Hard Rebel Camps or Bandit Raids.",
  "Achieve victory at 4 Medium Rebel Camps or Bandit Raids.",
  "Achieve victory at 4 Rebel Camps or Bandit Raids of any difficulty using Sons of Fenrir.",
  "Achieve victory at 5 Rebel Camps or Bandit Raids of any difficulty using Zykalian Militia.",
  "Achieve victory at 5 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 6 Easy Rebel Camps or Bandit Raids.",
  "Achieve victory at 6 Hard Rebel Camps or Bandit Raids.",
  "Achieve victory at 6 Medium Rebel Camps or Bandit Raids.",
  "Achieve victory at 6 Medium Rebel Camps or Bandit Rids.",
  "Achieve victory at 6 Rebel Camps or Bandit Raids of any Difficulty.",
  "Achieve victory at 6 Rebel Camps or Bandit Raids of any difficulty using Berserkers.",
  "Achieve victory at 6 Rebel Camps or Bandit Raids of any difficulty using Landsknechts.",
  "Achieve victory at 6 Rebel Camps or Bandit Raids of any difficulty with Outriders.",
  "Achieve victory at 6 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 6 Rebel Camps or bandit Raids of any difficulty.",
  "Achieve victory at 7 Rebel Camps or Bandit Raids of any difficulty using Axe Raiders.",
  "Achieve victory at 7 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 8 Easy Rebel Camps or Bandit Raids.",
  "Achieve victory at 8 Hard Rebel Camps or Bandit Raids.",
  "Achieve victory at 8 Medium Rebel Camps or Bandit Raids.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty using Banner Guards.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty using Claymores.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty using Spear Sergeants.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty using Yeomen.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty using shieldmaidens.",
  "Achieve victory at 8 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory at 9 Rebel Camps or Bandit Raids of any difficulty using Azaps.",
  "Achieve victory at 9 Rebel Camps or Bandit Raids of any difficulty.",
  "Achieve victory in 10 Bandit Raids.",
  "Achieve victory in 10 Raider Camp or Bandit Raids.",
  "Achieve victory in 10 Raider Camps or Bandit Raids.",
  "Achieve victory in 5 Bandit Raids.",
  "Achieve victory in 5 Raider Camps or Bandit Raids.",
  "Achieve victory in 8 Bandit Raids.",
  "Achieve victory in 8 Raider Camps or Bandit Raids.",
  "Achieve victory on 10 Rebel Camps or BanditRaids of any difficulty.",
  "Achieve victory on 6 Rebel Camps or Bandit Raids of any difficulty.",
  "Add 5 hero levels.",
  "Add 6 hero levels.",
  "Add 8 hero levels.",
  "Be Placed in the top 5 in 10 Field or Siege Battles of any type.",
  "Be placed in the top 5 in 10 Field or Siege Battles of any type.",
  "Be placed in the top 5 in 6 Field or Siege Battles of any type.",
  "Be placed in the top 5 in 8 Field or Siege Battles of any type.",
  "Be placed in the top 5 in 8 Field or Siege battles.",
  "Bring Sihladars to the battlefield and get an S in 7 Field or Siege Battles.",
  "Complete 10 Daily Quests.",
  "Complete 10 Deathmatch battles or earn 9 \"Hat-Trick\" or \"A Deadly Century\" badges in any battle.",
  "Complete 10 Fief Quests.",
  "Complete 12 Daily Quests.",
  "Complete 12 Fief Quests.",
  "Complete 14 Fief Quests.",
  "Complete 15 Daily Quests.",
  "Complete 15 Fief Quests.",
  "Complete 18 Fief Quests.",
  "Complete 20 Fief Quests.",
  "Complete 3 Free Battles or win 5 Field or Siege Battles of any type.",
  "Complete 3 Free Battles or win 5 Field or Siege battles.",
  "Complete 6 Deathmatches or get 8 hero kills/assists in 6 Field or Siege Battles of any type.",
  "Complete 6 Deathmatches or get 8 hero kills/assists in 6 Field or Siege Battles.",
  "Complete 7 Free Battles or win 5 Field or Siege Battles of any type.",
  "Complete 8 Fief Quests.",
  "Complete 8 Free Battles or win 4 Field or Siege Battles of any type in a row.",
  "Complete 8 fief Quests.",
  "Complete 9 Deathmatch battles or earn 10 \"Hat-Trick\" or \"A Deadly Century\" badges in any battle.",
  "Complete 9 Free Battles or win 8 Field or Siege Battles of any type.",
  "Complete any 20 Fief Quests.",
  "Complete any Fief Quest 10 times.",
  "Defeat 10 bands of wandering rebels.",
  "Defeat 10 rebel bands in the open world.",
  "Defeat 10 rebel or Marauder bands in the open world.",
  "Defeat 1000 enemy units in PVE battles.",
  "Defeat 1000 troops during Expeditions.",
  "Defeat 1000 troops during expeditions.",
  "Defeat 12 bands of wandering rebels.",
  "Defeat 12 rebel bands in the open world.",
  "Defeat 1200 enemy units in PVE battles.",
  "Defeat 1200 troops during Expeditions.",
  "Defeat 15 band of wandering rebels.",
  "Defeat 15 bands of wandering rebels.",
  "Defeat 15 rebel bands in the open world.",
  "Defeat 15 rebel or Marauder bands in the open world.",
  "Defeat 15 rebel or marauder bands in the open world.",
  "Defeat 1500 enemy units in PVE battles.",
  "Defeat 1500 troops during Expedition.",
  "Defeat 1500 troops during Expeditions.",
  "Defeat 1600 enemy units in PVE battles.",
  "Defeat 1600 troops during Expeditions.",
  "Defeat 18 bands of wandering rebels.",
  "Defeat 20 bands of rebels in the open world.",
  "Defeat 20 bands of wandering rebels.",
  "Defeat 20 heroes in Ranked battles, or get the \"Grand Bloodbath\" badge 4 times in Field or Siege Battles of any type.",
  "Defeat 20 heroesi n Ranked battles, or get the \"Grand Bloodbath\" badge 4 times in Field or Siege Battles of any type.",
  "Defeat 2000 troops during Expeditions.",
  "Defeat 25 rebel or Marauder bands in the open world.",
  "Defeat 30 bands of rebels in the open world.",
  "Defeat 30 heroes in Deathmatch battles, or get \"Hat-Trick\" or \"A Deadly Century\" in 8 Field or Siege battles.",
  "Defeat 30 heroes in Ranked Battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege Battles of any type.",
  "Defeat 30 heroes in Ranked battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege Battles of any type.",
  "Defeat 30 heroes in Ranked battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege battles.",
  "Defeat 30 heroes in Ranked battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege3 Battles of any type.",
  "Defeat 30 heroesi n Ranked Battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege Battles of any type.",
  "Defeat 30 rebel or Marauder bands in the open world.",
  "Defeat 30 rebels or Marauder bands in the open world.",
  "Defeat 35 heroes in Deathmatch battles, or get \"Hat-Trick\" in 8 Field or Siege Battles of any type.",
  "Defeat 700 enemy units in PVE battles.",
  "Defeat 700 troops during Expeditions.",
  "Defeat 800 enemy units in PVE battles.",
  "Defeat 800 troops during Expeditions.",
  "Defeat a band of rebel 10 times in the open world.",
  "Defeat a band of rebel 12 times in the open world.",
  "Defeat a band of rebels 10 times in the open world.",
  "Defeat a band of rebels 12 times in the open world.",
  "Defeat a band of rebels 15 times in the open world.",
  "Defeat a band of wandering Rebels 12 times.",
  "Defeat a total of 500 soldiers during Expeditions.",
  "Defeat heroes in Ranked battles, or get the \"Grand Bloodbath\" badge 6 times in Field or Siege Battles of any type.",
  "Deploy 10 artillery pieces.",
  "Deploy 20 artillery pieces.",
  "Deploy or destroy an artillery piece in 10 Field or Siege Battles of any type.",
  "Deploy or destroy an artillery piece in 10 Field or Siege battles.",
  "Deploy or destroy an artillery piece in 6 Field or Siege Battles of any type.",
  "Deploy or destroy an artillery piece in 7 Field or Siege battles.",
  "Deploy or destroy an artillery piece in 8 Field or Siege Battles of any type.",
  "Deploy or destroy an artillery piece in 8 Field or Siege battles.",
  "Destroy 10 artillery pieces.",
  "Destroy 15 arillery pieces.",
  "Destroy a siege engine or acquire 40 capture points 8 Field or Siege Battles of any type.",
  "Destroy a siege engine or acquire 40 capture points in 10 Field or Siege Battles of any type.",
  "Destroy a siege engine or acquire 40 capture points in 10 Field or Siege battles.",
  "Destroy a siege engine or acquire 40 capture points in 6 Field or Siege Battles of any type.",
  "Destroy a siege engine or acquire 40 capture points in 8 Field or Siege Battles of any type.",
  "Destroy a siege engine or acquire 40 capture points in 9 Field or Siege battles.",
  "Destroy a siege engine or acquire 40 capture points in10 Field or Siege Battles of any type.",
  "Destroy a siege tower or acquire 40 capture points in 6 Field or Siege Battles of any type.",
  "Destroy a siege tower or acquire 40 capture points in 8 Field or Siege Battles of any type.",
  "Destroy or deploy an artillery piece in 10 Field or Siege Battles of any type.",
  "Destroy or deploy an artillery piece in 4 Field or Siege battles.",
  "Destroy or deploy an artillery piece in 5 Field or Siege battles.",
  "Destroy or deploy an artillery piece in 6 Field or Siege Battles of any type.",
  "Destroy or deploy an artillery piece in 6 Field or Siege battles.",
  "Destroy or deploy an artillery piece in 7 Field or Siege Battles of any type.",
  "Destroy or deploy an artillery piece in 8 Field or Siege Battles of any type.",
  "Destroy or deploy an artillery piece in 9 Field or Siege battles.",
  "Destroy or deploy artillery piece in 7 Field or Siege Battles of any type.",
  "Earn \"No Quarter\" 4 times.",
  "Earn \"No Quarter\" 6 times.",
  "Earn \"No Quarter\" 8 times.",
  "Earn 10 \"A Deadly Century\" badges.",
  "Earn 10 \"Cakewalk\" badges during Expeditions.",
  "Earn 10 \"Cakewalk\" badges during PVE battles.",
  "Earn 10 \"Grand Bloodbath\" badges.",
  "Earn 10 \"Hat Trick\" badges.",
  "Earn 10 \"No Quarter\" badges.",
  "Earn 10 \"Shatter the Ranks\" badges.",
  "Earn 100 badges.",
  "Earn 12 \"Hat Trick\" badges.",
  "Earn 12 \"Shatter The Ranks\" badges.",
  "Earn 12 \"Shatter the Ranks\" badges.",
  "Earn 12 badges in Field or Siege Battles.",
  "Earn 120 badges.",
  "Earn 2 \"Combo Breaker\" badges.",
  "Earn 2 \"Hat Trick\" badges.",
  "Earn 20 silver or better badges.",
  "Earn 20 silver quality or better badges.",
  "Earn 25 silver or better badges.",
  "Earn 3 \"Combo Breaker\" badges.",
  "Earn 3 \"Hat Trick\" badges.",
  "Earn 3 \"Settle the Score\" badges.",
  "Earn 30 silver or better badges.",
  "Earn 4 \"Drop Dead\" badges.",
  "Earn 4 \"Grand Bloodbath\" badges.",
  "Earn 4 \"No Quarter\" badges.",
  "Earn 4 silver or better badges.",
  "Earn 40 capture points or interrupt a capture in 10 Field or Siege Battles of any type.",
  "Earn 40 capture points or interrupt a capture in 5 Ranked Battles.",
  "Earn 40 capture points or interrupt a capture in 6 Field or Siege Battles of any type.",
  "Earn 40 capture points or interrupt a capture in 6 Field or Siege battles.",
  "Earn 40 capture points or interrupt a capture in 7 Field or Siege Battles of any type.",
  "Earn 40 capture points or interrupt a capture in 8 Field or Siege Battles of any type.",
  "Earn 40 capture points or interrupt a capture in 8 Field or Siege battles.",
  "Earn 40 capture points or interrupt a capture in 8 Ranked Battles.",
  "Earn 40 capture points or interrupt a capture in 9 Field or Siege Battles of any type.",
  "Earn 40 capture points or interrupt a capture in 9 Ranked Battles.",
  "Earn 40 silver or better badges.",
  "Earn 5 \"Cakewalk\" badges during Expeditions using Axe Raiders.",
  "Earn 5 \"Cakewalk\" badges during Expeditions.",
  "Earn 5 \"Cakewalk\" badges during PVE battles.",
  "Earn 5 \"Hat Trick\" badges.",
  "Earn 5 \"Hat Trick\" or \"A Deadly Century\" badges.",
  "Earn 5 \"No Quarter\" badges.",
  "Earn 5 \"Shatter the Ranks\" badges.",
  "Earn 50 badges.",
  "Earn 6 \"Cakewalk\" badges during Expeditions.",
  "Earn 6 \"Cakewalk\" badges during PVE battles.",
  "Earn 6 \"Drop Dead\" badges.",
  "Earn 6 \"Hat Trick\" badges",
  "Earn 6 \"Hat Trick\" badges.",
  "Earn 6 \"No Quarter\" badges.",
  "Earn 6 \"Shatter the Rank\" badges.",
  "Earn 6 \"Shatter the Ranks\" badges.",
  "Earn 60 badges.",
  "Earn 7 \"Hat Trick\" badges.",
  "Earn 7 \"No Quarter\" badges.",
  "Earn 7 \"Shatter the Rank\" badges.",
  "Earn 7 \"Shatter the Ranks\" badges.",
  "Earn 8 \"A Deadly Centry\" or \"Hat-Trick\" badges.",
  "Earn 8 \"A Deadly Century\" badges.",
  "Earn 8 \"Cakewalk\" badges during Expeditions.",
  "Earn 8 \"Cakewalk\" badges during PVE battles.",
  "Earn 8 \"Cakewalk\" badges during expeditions.",
  "Earn 8 \"Cakewalk\" badges while using Northlander units during Expeditions.",
  "Earn 8 \"Hat Trick\" badges.",
  "Earn 8 \"No Quarter\" badges.",
  "Earn 8 \"Shatter the Ranks\" badges.",
  "Earn 80 badges.",
  "Earn 9 \"A Deadly Century\" badges.",
  "Earn 9 \"Cakewalk\" badges during Expeditions.",
  "Earn 9 \"Cakewalk\" badges during PVE battles.",
  "Earn 9 \"Shatter the Ranks\" badges.",
  "Earn a Troop Kill Score of 3000.",
  "Earn a Troop Kill Score of 4000.",
  "Earn a Troop Kill Score of 5000.",
  "Earn any silver or higher badge in 6 Field or Siege Battles of any type.",
  "Get 10 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 10 \"Quad Kill\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 10 \"Shatter the Ranks\" badges in Field or Siege battles.",
  "Get 20 kills or assists in Free Battles, or get 8 kills or assists in 6 Field or Siege Battles of any type.",
  "Get 20 kills or assists in Free Battles, or get 8 kills or assists in 7 Field or Siege Battles.",
  "Get 20 kills or assists in Free Battles, or get 8 kills or assists in 7 Field or Siege battles.",
  "Get 20 silver or better badges in any battle.",
  "Get 20 silver or gold badges in any battle.",
  "Get 25 kills or assists in Free Battles, or get 8 kills or assists in 7 Field or Siege Battles of any type.",
  "Get 25 silver or gold badges in any battle.",
  "Get 3 \"Say Cheese\" or \"Settle the Score\" badges in Field or Siege Battles of any type.",
  "Get 30 assists in Deathmatches.",
  "Get 30 kills in Deathmatches, or get 8 kills or assists in 6 Field or Siege Battles of any type.",
  "Get 30 kills in Deathmatches, or get 8 kills or assists in 6 Field or Siege battles.",
  "Get 30 kills or assists in Free Battles, or get 8 kills or assists in 6 Field or Siege Battles of any type.",
  "Get 30 total kills or assists in Field or Siege Battles of any type.",
  "Get 35 hero kills or assists in Ranked Battles or get 6 \"No Quarter\" badges in Field or Siege Battles of any type.",
  "Get 4 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 40 hero kills or assists in Free Battles.",
  "Get 40 kills or assists in Free Battles, or get 8 kills or assists in 8 Field or Siege Battles of any type.",
  "Get 40 kills or assists in Free Battles, or get 8 kills or asssits in 8 Field or Siege Battles of any type.",
  "Get 40 silver or better badges in any battle.",
  "Get 40 total kills or assists in Field or Siege Battles of any type.",
  "Get 40 total kills or assists in Field or Siege battles.",
  "Get 5 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 5 \"Say Cheese\" or \"Settle the Score\" badges in Field or Siege Battles of any type.",
  "Get 5 \"Say Cheese\" or \"Settle the Score\" badges in Field or Siege battles.",
  "Get 5 \"Shatter the Ranks\" badges in Field or Siege battles of any type.",
  "Get 50 kills or assists in Free Battles, or get 8 kills or assists in 10 Field or Siege Battles of any type.",
  "Get 50 kills or assists in Free Battles, or get 8 kills or assists in 10 Field or Siege Battles of any type..",
  "Get 50 total kills or assists in Field or Siege Battles of any type.",
  "Get 50 total kills or assists in Field or Siege battles.",
  "Get 6 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 7 \"Say Cheese\" or \"Settle the Score\" badges in Field or Siege Battles of any type.",
  "Get 8 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 8 \"No Quarter\" or \"Grand Bloodbath\" badges in Field or Siege battles.",
  "Get 8 \"Quarter\" or \"Grand Bloodbath\" badges in Field or Siege Battles of any type.",
  "Get 8 \"Shatter the Ranks\" badges in Field or Siege Battles of any type.",
  "Get 8 kill or assists in 7 Field or Siege Battles of any type.",
  "Get 8 kills or assists in 8 Field or Siege Battles of any type, or you or your group collectively kills a total of 35 heroes in Deathmatches.",
  "Get 8 kills or assists in 9 Field or Siege Battles of any type.",
  "Get 80 hero kills or assists in Free Battles.",
  "Get A Troop Kill Score of 300 or higher with 12 units in Field or Siege Battles of any type.",
  "Get A Troop Kill Score of 300 or higher with any unit in 10 Field or Siege Battles of any type.",
  "Get a K/D ratio of 2 or greater with a Northlander unit, during 12 Expedition battles.",
  "Get a Troop Kill Score of 1000 or higher in 4 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 1000 or higher in 6 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 1000 or higher in 7 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 1000 or higher in 7 Field or Siege battles.",
  "Get a Troop Kill Score of 1000 or higher in 7 Free Battles or earn the \"Grand Bloodbath\" badge 6 times in Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 1000 or higher in 8 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with 10 units in Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with 12 units in Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with 15 units in Field or Siege battles.",
  "Get a Troop Kill Score of 300 or higher with 15 units in any type of Field or Siege Battle.",
  "Get a Troop Kill Score of 300 or higher with a sword infantry unit, in 7 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with any unit in 10 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with any unit in 6 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with any unit in 7 Field or Siege battles.",
  "Get a Troop Kill Score of 300 or higher with any unit in 8 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 300 or higher with any unit in 9 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 400 or higher with any unit in 10 Field or Siege Battle of any type.",
  "Get a Troop Kill Score of 400 or higher with any unit in 10 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 400 or higher with any unit in 6 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 400 or higher with any unit in 6 Field or Siege battles.",
  "Get a Troop Kill Score of 400 or higher with any unit in 8 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 5000 in Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 600 or more in 10 Ranked battles, or get a Troop Kill Score of 1000 or more in 10 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 600 or more in 10 Ranked battles, or geta Troop Kill Score of 1000 or more 10 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 600 or more in 7 Ranked battles, or get a Troop Kill Score of 1000 or more in 10 Field or Siege battles.",
  "Get a Troop Kill Score of 600 or more in 8 Ranked battles, or get a Troop Kill Score of 1000 or more in 8 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 600 or more in 9 Free Battles, or get a Troop Kill Score of 1000 or more in 9 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 600 or more in 9 Ranked battles, or get a Troop Kill Score of 1000 or more in 9 Field or Siege battles.",
  "Get a Troop Kill Score of 800 or higher in 10 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 800 or higher in 7 Field or Siege Battles of any type.",
  "Get a Troop Kill Score of 800 or higher in 8 Field or Siege Battles of any type.",
  "Get a Troop Kill score of 800 or higher in 7 Field or Siege battles.",
  "Get a Troop Score of 300 or higher with any unit in 9 Field or Siege battles.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 10 Field or Siege Battles of any type.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 6 Field or Siege Battles of any type.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 6 Field or Siege battles.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 7 Field or Siege battles.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 8 Field or Siege Battles of any type.",
  "Get a kill/death ratio of 1.5 or higher with any unit in 9 Field or Siege battles.",
  "Get a kill/death ratio of 800 or higher in 10 Field or Siege battles.",
  "Get a kill/death ratio or higher with any unit in 8 Field or Siege Battles of any type.",
  "Get a troop Kill Score of 3000 or more in any type of Field or Siege battle.",
  "Get an A or better ranking in Free Battle 6 times.",
  "Get an A or better ranking in Free Battles 5 times.",
  "Get an A rank or better in 10 Free Battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rank or better in 10 Free battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rank or better in 6 Free battles, or get an A+ rating or better in 6 Field or Siege Battles of any type.",
  "Get an A rank or better in 7 Free battles, or get an A+ rating or better in 9 Field or Siege Battles of any type.",
  "Get an A rank or better in 8 Free battles, or get an A+ rating or better in 8 Field or Siege Battles of any type.",
  "Get an A rank or better in 9 Free battles, or get an A+ rating or better in 10 Field or Siege battles.",
  "Get an A ranking or better in 8 Deathmatches or earn No Quarter badges 6 times in any mode.",
  "Get an A rating or better in 10 Deathmatch battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rating or better in 10 Field or Siege attles of any type.",
  "Get an A rating or better in 10 Field or Siege battles.",
  "Get an A rating or better in 10 Free Battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rating or better in 10 Free battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rating or better in 6 Field or Siege Battle of any type.",
  "Get an A rating or better in 6 Field or Siege Battles of any type.",
  "Get an A rating or better in 6 Field or Siege battles.",
  "Get an A rating or better in 6 Free battles, or get an A+ rating or better in 6 Field or Siege Battles of any type.",
  "Get an A rating or better in 6 Ranked Battles or get A+ rating or better in 8 Field or Siege Battles of any type.",
  "Get an A rating or better in 7 Deathmatch battles, or get an A+ rating or better in 7 Field or Sieges battles.",
  "Get an A rating or better in 7 Deathmatch battles, or get an A+ rating or better in 9 Field or Siege battles.",
  "Get an A rating or better in 7 Field or Siege Battles of any type.",
  "Get an A rating or better in 7 Field or Siege battles.",
  "Get an A rating or better in 8 Field or Siege Battles of any type.",
  "Get an A rating or better in 8 Field or Siege battles.",
  "Get an A rating or better in 8 Free battles, or get an A+ rating or better in 8 Field or Siege Battles of any type.",
  "Get an A rating or better in 8 Ranked Battles or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A rating or better in 9 Field or Siege Battles of any type.",
  "Get an A rating or better in 9 Field or Siege battles.",
  "Get an A rating or better in 9 Free Battles or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A+ arting or better in 8 Expedition battles.",
  "Get an A+ ranking or better in 10 Expedition battles.",
  "Get an A+ ranking or better in 15 Expedition battles.",
  "Get an A+ ranking or better in 8 Expedition battles.",
  "Get an A+ rankings or better in 10 Expedition battles.",
  "Get an A+ rating or better in 10 Deathmatche battles, or get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A+ rating or better in 10 Expedition battles.",
  "Get an A+ rating or better in 10 Expeditions battles.",
  "Get an A+ rating or better in 10 Field or Siege Battles of any type.",
  "Get an A+ rating or better in 10 PVE battles.",
  "Get an A+ rating or better in 5 Expedition battles.",
  "Get an A+ rating or better in 8 Expedition battles.",
  "Get an A+ rating or better in Expedition battles.",
  "Get and A+ rating or better in 10 Expedition battles.",
  "Get and A+ rating or better in 8 Expedition battles.",
  "Get ranked in the top 5 in 10 Field or Siege Battles of any type.",
  "Get ranked in the top 5 in 7 Field or Siege Battles of any type.",
  "Get ranked in the top 5 in 7 Field or Siege battles.",
  "Get ranked in the top 5 in 8 Field or Siege Battles of any type.",
  "Get ranked in the top 5 in 8 Ranked Battles, or get MVP in 6 Field or Siege Battles of any type.",
  "Get ranked in the top 5 in 9 Free Battles, or get MVP in 5 Field or Siege battles.",
  "Get ranked in the top five 10 times or get MVP 10 times in Field or Siege battles.",
  "Get the \"A Deadly Century\" badge 7 times.",
  "Get the \"Hat-Trick\" badge in 9 Free Battles, or get the \"Quad Kill\" badge in 9 Field or Siege Battles of any type.",
  "Get the \"Hat-Trick\" or \"A Deadly Century\" badge in 5 Field or Siege Battles of any type.",
  "Get the \"Hat-Trick\" or \"A Deadly Century\" badge in 6 Field or Siege Battles of any type.",
  "Get the \"Hat-Trick\" or \"A Deadly Century\" badge in 7 Field or Siege Battles of any type.",
  "Get the \"Hat-Trick\" or \"A Deadly Century\" badge in 9 Field or Siebe Battles of any type.",
  "Get the \"Hat-Trick\" or \"A Deadly Century\" badge in 9 Field or Siege Battles of any type.",
  "Have a unit get a 1.5 kill/death ratio or better in 6 Free Battles, or get an A rating or better in 9 Field or Siege Battles.",
  "Have your unit push a siege tower to the walls 3 times.",
  "Have your unit push a siege tower to the walls 5 times.",
  "In 10 Field or Siege Battles, get 8 kills or assists.",
  "In 10 Field or Siege Battles, send at least 4 units with different star level into battle.",
  "In 10 Field or Siege Battles, send at least 4 units with different star levels into battle.",
  "In 10 Siege or Field Battles, use artillery to kill 30 troops or kill 2 enemy heroes.",
  "In 10 Siege or Field Battles, use artillery to kill 40 troops or kill 2 enemy heroes.",
  "In 4 Siege Battles, destroy a siege engine or get 40 capture points.",
  "In 4 Siege Battles, destroy a siege engines or get 40 capture points 4 times.",
  "In 5 Expeditions, achieve a rating of C or better.",
  "In 6 Field or Siege Battles, send at least 4 unit with different star levels into battle.",
  "In 6 Siege Battles, destroy a siege engine or get 40 capture points.",
  "In 6 Siege Battles, destroy siege engine or get 40 capture points.",
  "In 6 Siege or Field Battles, kill 60 troops per battle.",
  "In 7 Field or Siege Battles, get 8 kills or assists.",
  "In 7 Siege or Field Battles, use artillery to kill 30 troops or kill 2 enemy heroes.",
  "In 7 Siege or Field Battles, use artillery to kill 80 troops or destroy 2 artillery pieces.",
  "In 7 Siege or Field Battles, you or your group collectively kills a total of 240 soldiers.",
  "In 8 Siege Battles, destroy 8 siege engines or get 40 capture points.",
  "In 8 Siege Battles, destroy a siege engine or get 40 capture points 8 times.",
  "In 8 Siege Battles, destroy a siege engine or get 40 capture points.",
  "In 8 Siege or Field Battles, use artillery to kill 30 troops or kill 2 enemy heroes.",
  "In 9 Siege Battles, destroy a siege engine or get 40 capture.",
  "In 9 Siege or Field Battles, you or your group collectively kills a total of 240 soldiers.",
  "In Deathmatch, get an A ranking or better 10 times.",
  "In Deathmatch, get an A ranking or better 7 times.",
  "In Deathmatch, get an A ranking or better 8 times.",
  "In Deathmatch, you or your collectively kills a total of 150 heroes.",
  "In Deathmatch, you or your group collectively kills a total of 100 heroes.",
  "In Deathmatch, you or your group collectively kills a total of 120 heroes.",
  "In Deathmatch, you or your group collectively kills a total of 150 heroes.",
  "In Deathmatch, you or your group collectively kills a total of 30 heroes.",
  "In Deathmatch, you or your group collectively kills a total of 50 heroes.",
  "In Expedition Mode get an A+ ranking or better 6 times.",
  "In Expedition Mode get an S ranking 10 times.",
  "In Expedition Mode get an S ranking 8 times.",
  "In Expedition, take the Berserkers into battle and defeat 2000 enemy soldiers.",
  "In Expedition, take the Berserkers into battle and defeat 2000 troops.",
  "In Expedition, take the Berserkers into battle and get a rating of A+ or higher 8 times.",
  "In Expedition, use Varangian Guards and win 10 times.",
  "In Expeditions, get an A or better ranking 10 times.",
  "In Expeditions, get an A or better ranking 6 times.",
  "In Expeditions, get an A or better ranking 8 times.",
  "In Expeditions, get an A ranking or better 10 times.",
  "In Expeditions, get an A ranking or better 12 times.",
  "In Expeditions, get an A ranking or better 6 times.",
  "In Expeditions, get an A ranking or better 7 times.",
  "In Expeditions, get an A ranking or better 8 times.",
  "In Expeditions, get an A ranking or better 9 times.",
  "In Expeditions, get an A rating or better 8 times.",
  "In Expeditions, get an A+ or better ranking 5 times.",
  "In Expeditions, get an A+ or better ranking 8 times.",
  "In Expeditions, get an A+ ranking or better 4 times.",
  "In Expeditions, get an A+ ranking or better 5 times.",
  "In Expeditions, get an A+ ranking or better 6 times",
  "In Expeditions, get an A+ ranking or better 6 times.",
  "In Expeditions, get an A+ ranking or better 8 times.",
  "In Expeditions, get an S or better ranking 5 times.",
  "In Expeditions, get an S or better ranking 6 times.",
  "In Expeditions, get an S ranking or better 8 times.",
  "In Expeditions, kill 200 soldiers 6 times.",
  "In Expeditions, kill 200 soldiers 7 times.",
  "In Expeditions, kill 200 soldiers 9 times.",
  "In Expeditions, take 2-star or better units into battle 6 times.",
  "In Expeditions, take 2-star or better units into battle 8 times.",
  "In Expeditions, take 2-star units into battle 6 times.",
  "In Expeditions, take 4-star or better units into battle 10 times.",
  "In Expeditions, take Shenji Grenadiers into battle and get a rating of A or higher 10 times.",
  "In Expeditions, take Silver Era or later untis into battle 8 times.",
  "In Expeditions, take Soldiers of Fortune units into battle 8 times.",
  "In Expeditions, take Steppe units into battle and have them cause damage 10 times.",
  "In Expeditions, take archer unit into battle 6 times.",
  "In Expeditions, take the Modao Battalion into battle and get a rating of A+ or higher 7 times.",
  "In Expeditions, use 2-star or better units to defeat 100 troops.",
  "In Expeditions, use 2-star or better units to defeat 1500 troops.",
  "In Expeditions, use Fire Lancers and win 10 times.",
  "In Expeditions, use Northlander units and get an A ranking or better 12 times.",
  "In Expeditions, use Northlander units and get an A ranking or better 8 times.",
  "In Expeditions, use Silahdarrs and get an A ranking or better 10 times.",
  "In Expeditions, use Steppe units to deal 10000000 damage.",
  "In Expeditions, use Steppe units to deal 6 damage.",
  "In Expeditions, use Zykalian Militia in 6 battles.",
  "In Expeditions, use an Anadolou Empire unit and get an A ranking or better 10 times.",
  "In Expeditions, use an Anadolou Empire unit to kill 1200 troops.",
  "In Expeditions, use cavalry 8 times.",
  "In Expeditions, use sword infantry to kill 800 troops.",
  "In Expeditions, use sword units to deal 3000000 damage.",
  "In Expeditions, use units from the Cavalry unit tree to kill 1000 troops.",
  "In Field or Siege Battles of any type, get 40 badges of any quality or get 6 silver or better badges.",
  "In Field or Siege Battles of any type, get 60 iron or better badges; or get 10 silver or better badges.",
  "In Field or Siege Battles of any type, get 80 badges.",
  "In Field or Siege Battles of any type, get 80 iron or better badges, or get 12 silver or better badges.",
  "In Field or Siege Battles of any type, get a Troop Kill Score of 300 or higher with 12 units.",
  "In Field or Siege Battles of any type, get a Troop Kill Score of 400 or higher with 10 units.",
  "In Field or Siege Battles of any type, get a Troop Kill Score of 400 or higher with 12 units.",
  "In Field or Siege Battles of any type, get a Troop Kill Score of 400 or higher with 8 units.",
  "In Field or Siege Battles of any type, get a Troop Kill Score of 400 or higher withj 12 units.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1 or higher with any two unit 10 times.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1 or higher with any two units 10 times.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1 or higher with any two units 6 times.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1 or higher with any two units 8 times.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1.5 or higher with any unit 6 times.",
  "In Field or Siege Battles of any type, get a kill/death ratio of 1.5 or higher with any unit 9 times.",
  "In Field or Siege Battles of any type, get a silver or better badge 10 times.",
  "In Field or Siege Battles of any type, get get a kill/death ratio of 1.5 or higher with any unit 15 times.",
  "In Field or Siege Battles of any type, get ranked in the top 5 10 times or get MVP 5 times.",
  "In Field or Siege Battles of any type, geta kill/death ratio of 1 or higher with any two units 8 times.",
  "In Field or Siege Battles of any type, geta kill/death ratio of 1.5 or higher with any unit 15 times.",
  "In Field or Siege Battles of any type, use Camel Lancers' to kill 30 enemy soldiers .",
  "In Field or Siege Battles of any type, use Chevaliers to kill 300 enemy soldiers.",
  "In Field or Siege Battles of any type, use Retiarii and kill 300 enemy soldiers.",
  "In Field or Siege Battles of any type, use Yanyuedao Cavalry to kill 450 enemy soldiers.",
  "In Field or Siege Battles of any type, use Zweihander \"Combo Slams\" skills to kill 200 soldiers.",
  "In Field or Siege Battles of any type, use any Queen's Knights skill to kill 160 enemy soldiers.",
  "In Field or Siege Battles of any type, use sword infantry units to kill 300 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Crescent Monks \"Deadly Epicycle\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Kriegsbruder \"Bloodbath\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Onna-mush \"Onslaught\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Onna-musha \"Charge\" skill to kill 100 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Orochi Samurai \"Disrupting Sweep\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Orochi Samurai \"Double Strike\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Perceval’s Royal Guards \"Throw Javelin” skill to kill 120 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Retiarii \"Spearfishing\" skill to kill 80 enemy soldiers.",
  "In Field or Siege Battles of any type, use the Yanyuedao Cavalry's \"Dead Unleashed\" skill to kill 200 enemy soldiers.",
  "In Field or Siege Battles of any type, win 3 battles in a row or join 5 battles.",
  "In Field or Siege Battles of any type, you or your group members get 20 A or better rankings or 10 A+ or better rankings.",
  "In Field or Siege Battles of any type, you or your group members get 25 A+ or better rankings or 8 S rankings.",
  "In Field or Siege Battles of any type, you or your group members get 30 B+ or better ratings or get 6 A+ or better ratings.",
  "In Field or Siege Battles of any type, you or your group members get 40 B+ or better rankings or get 8 A+ or better rankings.",
  "In Field or Siege Battles of any type, you or your group members get 40 B+ or better ratings or get 8 A+ or better ratings.",
  "In Field or Siege Battles of any type, you or your group members get 40 B+ or better ratings or get A+ or better ratings.",
  "In Field or Siege Battles of any type, you or your group members get 50 B+ or better ratings or get 10 A+ or better ratings.",
  "In Field or Siege Battles, be among the top 10 in the score rankings 8 times.",
  "In Field or Siege Battles, be among the top 5 in the score rankings 3 times.",
  "In Field or Siege Battles, be among the top 5 in the score rankings 5 times.",
  "In Field or Siege Battles, be among the top 5 in the score rankings 8 times.",
  "In Field or Siege Battles, deal 10000000 damage.",
  "In Field or Siege Battles, deploy 10 artillery",
  "In Field or Siege Battles, deploy 10 artillery.",
  "In Field or Siege Battles, deploy 15 artillery.",
  "In Field or Siege Battles, deploy 20 artillery.",
  "In Field or Siege Battles, deploy 3 artillery.",
  "In Field or Siege Battles, deploy 8 artillery.",
  "In Field or Siege Battles, destroy 10 artillery.",
  "In Field or Siege Battles, destroy 12 artillery.",
  "In Field or Siege Battles, destroy 20 artillery.",
  "In Field or Siege Battles, destroy 8 Siege Engines.",
  "In Field or Siege Battles, destroy 8 siege towers.",
  "In Field or Siege Battles, earn 150 capture points",
  "In Field or Siege Battles, earn 150 capture points.",
  "In Field or Siege Battles, earn 240 capture points.",
  "In Field or Siege Battles, earn 300 capture points.",
  "In Field or Siege Battles, earn 500 capture points.",
  "In Field or Siege Battles, get 20 assists.",
  "In Field or Siege Battles, get 25 assists.",
  "In Field or Siege Battles, get 280 capture points.",
  "In Field or Siege Battles, get 30 assists.",
  "In Field or Siege Battles, get 30 kills or assists.",
  "In Field or Siege Battles, get 300 capture points.",
  "In Field or Siege Battles, get 40 assists.",
  "In Field or Siege Battles, get 40 kills or assists.",
  "In Field or Siege Battles, get 45 total kills or assists.",
  "In Field or Siege Battles, get 50 assists or kills.",
  "In Field or Siege Battles, get 500 capture points.",
  "In Field or Siege Battles, get 60 total kills or assists.",
  "In Field or Siege Battles, get a B+ or better 10 times.",
  "In Field or Siege Battles, get a B+ rating or better 10 times.",
  "In Field or Siege Battles, get a B+ rating or better 5 times.",
  "In Field or Siege Battles, get a B+ rating or better 8 times.",
  "In Field or Siege Battles, get an A rating or better 5 times.",
  "In Field or Siege Battles, get an A rating or better 6 times.",
  "In Field or Siege Battles, get an A rating or better 7 times.",
  "In Field or Siege Battles, get an A rating or better 8 times.",
  "In Field or Siege Battles, get an A+ rating or better 10 times.",
  "In Field or Siege Battles, get an A+ rating or better 3 times.",
  "In Field or Siege Battles, get an A+ rating or better 4 times.",
  "In Field or Siege Battles, get an A+ rating or better 6 times.",
  "In Field or Siege Battles, get an A+ rating or better 8 times.",
  "In Field or Siege Battles, get an S rating or better 5 times.",
  "In Field or Siege Battles, have any unit kill/death ratio reach 1 or\nabove 7 times.",
  "In Field or Siege Battles, have any unit kill/death ratio reach 1 or above 10 times.",
  "In Field or Siege Battles, have any unit kill/death ratio reach 1 or above 5 times.",
  "In Field or Siege Battles, have any unit kill/death ratio reach 1 or above 6 times.",
  "In Field or Siege Battles, have any unit kill/death ratio reach 1 or above 8 times.",
  "In Field or Siege Battles, have any unit's kill/death ratio reach 1 or above 12 times.",
  "In Field or Siege Battles, have any unit's kill/death ratio reach 1 or above 6 times.",
  "In Field or Siege Battles, have any unit's kill/death ratio reach 1 or above 7 times.",
  "In Field or Siege Battles, have any unit's kill/death ratio reach 1 or above 8 times.",
  "In Field or Siege Battles, have any unit's kill/death ratio reach 1 or above 9 times.",
  "In Field or Siege Battles, have firearm-wielding units get a kill/death ratio reach 1.5 or above 9 times.",
  "In Field or Siege Battles, interrupt enemies trying to capture points 6 times.",
  "In Field or Siege Battles, interrupt enemies trying to capture points 8 times.",
  "In Field or Siege Battles, kill 10 heroes.",
  "In Field or Siege Battles, kill 100 sword infantry.",
  "In Field or Siege Battles, kill 12 heroes.",
  "In Field or Siege Battles, kill 15 heroes.",
  "In Field or Siege Battles, kill 18 heroes.",
  "In Field or Siege Battles, kill 20 heroes.",
  "In Field or Siege Battles, kill 25 heroes.",
  "In Field or Siege Battles, kill 300 troops.",
  "In Field or Siege Battles, kill 40 sword cavalry.",
  "In Field or Siege Battles, kill 450 soldiers.",
  "In Field or Siege Battles, kill 500 troops.",
  "In Field or Siege Battles, kill 600 soldiers.",
  "In Field or Siege Battles, kill 600 troops.",
  "In Field or Siege Battles, kill 750 soldiers.",
  "In Field or Siege Battles, kill 750 troops.",
  "In Field or Siege Battles, kills 15 heroes.",
  "In Field or Siege Battles, kills 600 soldiers.",
  "In Field or Siege Battles, take 2-star or better units into battle 7 times.",
  "In Field or Siege Battles, take 2-star or better units into battle and win 5 times.",
  "In Field or Siege Battles, take 4-star or better units into battle 10 times.",
  "In Field or Siege Battles, take Soldiers of Fortune into battle and deal 4000000 damage.",
  "In Field or Siege Battles, take Soldiers of Fortune into battle and deal 5000000 damage.",
  "In Field or Siege Battles, take Soldiers of Fortune into battle and win 5 times.",
  "In Field or Siege Battles, take Soldiers of Fortune units into battle and get a\nkill/death ratio of greater than 1 8 times.",
  "In Field or Siege Battles, take a Soldiers of Fortune units into battle and\nget a kill/death ratio of greater than 1 8 times.",
  "In Field or Siege Battles, take archer units into battle 7 times.",
  "In Field or Siege Battles, take archer units into battle and win 4 times.",
  "In Field or Siege Battles, take steppe units into battle 8 times.",
  "In Field or Siege Battles, take steppe units into battle and deal 4000000 damage.",
  "In Field or Siege Battles, take steppe units into battle and win 5 times.",
  "In Field or Siege Battles, take sword infantry into battle 8 times.",
  "In Field or Siege Battles, take sword infantry into battle and win 4 times.",
  "In Field or Siege Battles, use Axe Raiders to kill 200 troops.",
  "In Field or Siege Battles, use Brace Weapons-type skills to kill 10 troops.",
  "In Field or Siege Battles, use Brace Weapons-type skills to kill 100 troops.",
  "In Field or Siege Battles, use Men-at-Arms to deal 1500000 damage.",
  "In Field or Siege Battles, use Men-at-Arms to kill 300 enemy soldiers.",
  "In Field or Siege Battles, use Outriders and get a Troop Kill Score of 200 or higher in 6 battles.",
  "In Field or Siege Battles, use Outriders to kill 80 troops.",
  "In Field or Siege Battles, use Shieldmaidens to kill 600 soldiers.",
  "In Field or Siege Battles, use Shieldmaidens to take 7000000 damage.",
  "In Field or Siege Battles, use Shieldmaidens' skill \"Freyja's Charge\" to deal 1000000 damage.",
  "In Field or Siege Battles, use a Charge-type unit skill to kill 100 or more troops.",
  "In Field or Siege Battles, use a Charge-type unit skill to kill 180 or more troops.",
  "In Field or Siege Battles, use a sword cavalry unit in battle and win 2 times.",
  "In Field or Siege Battles, use archer units to deal 1000000 damage.",
  "In Field or Siege Battles, use artillery to kill 100 troops.",
  "In Field or Siege Battles, use artillery to kill 120 troops.",
  "In Field or Siege Battles, use artillery to kill 140 troops.",
  "In Field or Siege Battles, use artillery to kill 160 troops.",
  "In Field or Siege Battles, use artillery to kill 200 troops.",
  "In Field or Siege Battles, use artillery to kill 220 troops.",
  "In Field or Siege Battles, use artillery to kill 280 troops.",
  "In Field or Siege Battles, use artillery to kill 300 troops.",
  "In Field or Siege Battles, use artillery to kill 80 troops.",
  "In Field or Siege Battles, use charge-type skills to kill 120 soldiers.",
  "In Field or Siege Battles, use charge-type skills to kill 180 enemy soldiers.",
  "In Field or Siege Battles, use charge-type skills to kill enemy heroes 100 times.",
  "In Field or Siege Battles, use eastern spearmen to take 1200000 damage.",
  "In Field or Siege Battles, use eastern spearmen to take 1500000 damage.",
  "In Field or Siege Battles, use eastern spearmen to take 2000000 damage.",
  "In Field or Siege Battles, use eastern spearmen to take 6000000 damage.",
  "In Field or Siege Battles, use polearm units to deal 4000000 damage.",
  "In Field or Siege Battles, use shortsword & shield units to deal 4000000 damage.",
  "In Field or Siege Battles, use shortsword & shield units to deal 4500000 damage.",
  "In Field or Siege Battles, use sword infantry to deal 2000000 damage.",
  "In Field or Siege Battles, use sword infantry to kill 200 troops.",
  "In Field or Siege Battles, use the Axe Raiders skill Double Axe to kill 80 troops.",
  "In Field or Siege Battles, use the Sons of Fenrir to kill 50 ranged soldiers.",
  "In Field or Siege Battles, win 4 times.",
  "In Field or Siege Battles, win without taking a 1-star unit 4 times.",
  "In Field or Siege Battles, win without taking a 1-star unit 6 times.",
  "In Field or Siege Battles, your eastern spearmen take 5000000 damage.",
  "In Field or Siege battles of any type, get 40 silver badges or higher.",
  "In Field or Siege battles of any type, get the Shatter the Ranks badge 5 times.",
  "In Field or Siege battles of any type, you or your group members get 30 B+ or better rankings or 8 A+ or better rankings.",
  "In Field or Siege battles of any type, you or your group members get 30 B+ or better ratings or 8 A+ or better ratings.",
  "In Field or Siege battles, get 3 \"No Quarter\" badges.",
  "In Field or Siege battles, get 80 silver badges or higher.",
  "In Field or Siege battles, get a Troop Kill Score of 400 or higher with 10 units.",
  "In Field or Siege battles, get a kill/death ratio of 1.5 or higher with any unit 6 times.",
  "In Field or Siege battles, get a kill/death ratio of 1.5 or higher with any unit 9 times.",
  "In Field or Siege battles, get an iron or better badge 20 times.",
  "In Field or Siege battles, get the Shatter the Ranks badge 5 times.",
  "In Field or Siege battles, use Claymore to kill 200 enemy soldiers.",
  "In Field or Siege battles, use artillery to kill 140 soldiers or 8 heroes.",
  "In Field or Siege battles, win 3 battles in a row or join 8 battles.",
  "In Field or Siege battles, you or your group members get 30 B+ or better rankings or 8 A+ or better rankings.",
  "In Field or Siege battles, you or your group members get 40 B+ or better rankings or get 10 A+ or better rankings.",
  "In Free Battkesm deal, 400000 Critical damage.",
  "In Free Battle mode, take the Berserkers into battle 8 times.",
  "In Free Battles use artillery to kill 160 troops.",
  "In Free Battles, deal 250000 Critical damage.",
  "In Free Battles, deal 300000 Critical damage.",
  "In Free Battles, deal 400000 Critical damage.",
  "In Free Battles, get an A rank or better 5 times, or get an A rating or better in 5 Field or Siege battles.",
  "In Free Battles, get an A ranking or better 8 times.",
  "In Free Battles, kill 100 troops",
  "In Free Battles, kill 15 enemy heroes.",
  "In Free Battles, kill 300 troops.",
  "In Free Battles, kill 400 troops.",
  "In Free Battles, kill 600 troops.",
  "In Free Battles, kill 80 troops.",
  "In Free Battles, take 3-star or better sword units into battle 4 times.",
  "In Free Battles, take 3-star or better units into battle 5 times.",
  "In Free Battles, take 4-star or better units into battle and kill 400 troops.",
  "In Free Battles, take 4-star or better units into battle and win 3 times.",
  "In Free Battles, take 4-star or better units into battle and win 8 times.",
  "In Free Battles, take Azaps into battle 9 times.",
  "In Free Battles, take Silahdars into battle and win 6 times.",
  "In Free Battles, use Liao's Rangers and win 6 times.",
  "In Free Battles, use Siphonarioi and win 4 times.",
  "In Free Battles, use sword infantry to kill 280 troops.",
  "In Free Battles, use the Silahdars Deathstrike skill to deal 4000000 damage.",
  "In Free Battles, use units from the Cavalry unit tree to deal 3000000.",
  "In Free Battles, you or you group collectively kills a total of 30 heroes.",
  "In Free Battles, you or your group collectively kills a total of 80 heroes.",
  "In PVP battles, get the \"Hat-Trick\" badge 5 times.",
  "In Ranked Battles, get an A ranking or better 10 times.",
  "In Ranked Battles, get an A ranking or better 6 times.",
  "In Ranked Battles, get an A ranking or better 7 times.",
  "In Ranked Battles, get an A ranking or better 8 times.",
  "In Ranked Battles, get an S ranking 8 times.",
  "In Ranked Battles, kill 120 soldiers 9 times.",
  "In Ranked Battles, rank in the top 5 4 times.",
  "In Ranked Battles, rank in the top 5 6 times.",
  "In Ranked Battles, rank in the top 5 8 times.",
  "In Ranked Battles, take the Berserkers into battle 6 times while getting a KD of atleast 4.",
  "In Ranked Battles, use Liao's Rangers 6 and win times.",
  "In Ranked Battles, use Shenji Grenadiers and win or get an A ranking or better 5 times.",
  "In Ranked Battles, use Siphonarioi and get a kill/death ratio of 1 or greater in 8 battles.",
  "In Ranked Battles, your Liaos's Rangers get a K/D ratio of 1 or higher 10 times.",
  "In Siege Battles, deploy or destroy an artillery piece 12 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 10 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 11 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 12 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 5 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 6 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 7 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 8 battles.",
  "In Siege Battles, deploy or destroy an artillery piece in 9 battles.",
  "In Siege Battles, destroy 12 artillery pieces.",
  "In Siege Battles, destroy 3 siege engines.",
  "In Siege Battles, destroy 4 siege engines.",
  "In Siege Battles, destroy 6 siege engines.",
  "In Siege Battles, destroy 7 siege engines or get 40 capture points 7 times.",
  "In Siege Battles, destroy 8 siege engines.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points 6 times.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 10 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 11 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 12 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 5 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 6 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture points in 8 battles.",
  "In Siege Battles, destroy a siege ladder or acquire 15 capture poitns in 10 battles.",
  "In Siege Battles, earn 40 capture points or interrupt a capture in 6 battles.",
  "In Siege Battles, earn 40 capture points or interrupt a capture in 7 battles.",
  "In Siege Battles, earn 40 capture points or interrupt a capture in 8 battles.",
  "In Siege Battles, earn 40 capture points or interrupt a capture in 9 battles.",
  "In Siege Battles, get the \"Say Cheese\" badge 3 times.",
  "In Siege Battles, get the \"Say Cheese\" badge 4 times.",
  "In Siege Battles, get the \"Say Cheese\" badge 6 times.",
  "In Siege Battles, get the \"Say Cheese\" badge 8 times.",
  "In Siege Battles, kick over 10 ladders put up by the enemy.",
  "In Siege Battles, kick over 12 ladders put up by the enemy.",
  "In Siege Battles, kick over 15 ladders put up by the enemy.",
  "In Siege Battles, kill 15 heroes.",
  "In Siege Battles, kill 200 enemies with the Berserkers Frenzy skill.",
  "In Siege Battles, knock down two ladders put up by the enemy in 8 battles.",
  "In Siege Battles, push 3 siege towers to the ramparts or destroy 3 Siege Engines.",
  "In Siege Battles, push a siege tower to the ramparts once or interrupt\na capture once in 4 battles.",
  "In Siege Battles, push a siege tower to the ramparts once or interrupt a capture once in 8 battles.",
  "In Siege Battles, push a siege tower to the ramparts or\ndestroy an artillery piece 8 times.",
  "In Siege Battles, use Janissaries and earn a kill/death ratio greater than 1 in 6 battles.",
  "In Siege Battles, use a siege engine or interrupt a capture once in 5 battles.",
  "In Siege Battles, use a trebuchet or interrupt a capture 12 times.",
  "In Siege Battles, use trebuchets 10 times.",
  "In Siege Battles, use trebuchets 5 times.",
  "In Siege Battles, use trebuchets 7 times.",
  "In Siege of Field Battles, get an A rating or better 7 times.",
  "In Siege or Field Battles use Modao Battalion to kill 300 soldiers.",
  "In Siege or Field Battles, all members of your group get a B+ or better ranking 30 times.",
  "In Siege or Field Battles, deal 180000 Critical damage.",
  "In Siege or Field Battles, deal 300000 Critical damage.",
  "In Siege or Field Battles, deal 400000 Critical damage.",
  "In Siege or Field Battles, deal 500000 Critical damage.",
  "In Siege or Field Battles, deal 600000 Critical damage.",
  "In Siege or Field Battles, earn 10 \"A Deadly Century\" badges.",
  "In Siege or Field Battles, earn 12 \"A Deadly Century\" badges.",
  "In Siege or Field Battles, earn 40 capture points or\ninterrupt a capture in 10 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt\na capture in 6 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a\ncapture in 7 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a capture in 10 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a capture in 12 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a capture in 4 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a capture in 7 battles.",
  "In Siege or Field Battles, earn 40 capture points or interrupt a capture in 8 battles.",
  "In Siege or Field Battles, earn 40 capture points or interurpt a capture in 12 battles.",
  "In Siege or Field Battles, earn 6 \"A Deadly Century\" badges.",
  "In Siege or Field Battles, earn 8 \"A Deadly Century\" badges.",
  "In Siege or Field Battles, earn 9 \"A Deadly Century\" badges.",
  "In Siege or Field Battles, get \"Hat-Trick\" 5 times.",
  "In Siege or Field Battles, get 40 assists.",
  "In Siege or Field Battles, get A Deadly Century 6 times.",
  "In Siege or Field Battles, get Combo Breaker 4 times.",
  "In Siege or Field Battles, get Drop Dead 3 times.",
  "In Siege or Field Battles, get Hat-Trick 3 times.",
  "In Siege or Field Battles, get an A rating or better 10 times.",
  "In Siege or Field Battles, get an A rating or better 6 times.",
  "In Siege or Field Battles, get an A rating or better 8 times.",
  "In Siege or Field Battles, get an A rating or better 9 times.",
  "In Siege or Field Battles, get an S rating or better 6 times.",
  "In Siege or Field Battles, get an S rating or better 7 times.",
  "In Siege or Field Battles, get an S rating or better 8 times.",
  "In Siege or Field Battles, get ranked in the top 5 10 times.",
  "In Siege or Field Battles, get ranked in the top 5 12 times.",
  "In Siege or Field Battles, get ranked in the top 5 5 times.",
  "In Siege or Field Battles, get ranked in the top 5 6 times.",
  "In Siege or Field Battles, get ranked in the top 5 7 times.",
  "In Siege or Field Battles, get ranked in the top 5 8 times.",
  "In Siege or Field Battles, get ranked in the top 5 9 times.",
  "In Siege or Field Battles, get ranked in the top 8 8 times.",
  "In Siege or Field Battles, get ranked in top 5 9 times.",
  "In Siege or Field Battles, have any unit kill/death ratio reach 1 or above 12 times.",
  "In Siege or Field Battles, have any unit kill/death ratio reach 1 or above 6 times.",
  "In Siege or Field Battles, have any unit kill/death ratio reach 1 or above 8 times.",
  "In Siege or Field Battles, have any unit kill/death ratio reach 1 or above 9 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1 or above 10 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1 or above 7 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1 or above 8 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1.5 or above 5 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1.5 or above 6 times.",
  "In Siege or Field Battles, have any unit's kill/death ratio reach 1.5 or above 7 times.",
  "In Siege or Field Battles, kill 18 heroes.",
  "In Siege or Field Battles, take Axe Raiders into battle 5 times while getting a K/D ratio of above 1.5.",
  "In Siege or Field Battles, take Silahdars into battle and get a kill/death\nratio greater than 1 11 times.",
  "In Siege or Field Battles, take a Silahdars into battle and win 7 times.",
  "In Siege or Field Battles, take the Berserkers into battle and earn an A ranking or better 6 times.",
  "In Siege or Field Battles, take the Swinefeathers into battle and get a Unit Kill Score of at least 300 8 times.",
  "In Siege or Field Battles, use Armiger Lancers 8 times.",
  "In Siege or Field Battles, use Azaps to kill 250 troops.",
  "In Siege or Field Battles, use Cudgel Monks and get an A rating or better 6 times.",
  "In Siege or Field Battles, use Empyrean or Symmachean units to deal 5000000 damage.",
  "In Siege or Field Battles, use Janissaries to kill 180 troops.",
  "In Siege or Field Battles, use Landsknechts to kill 160 troops.",
  "In Siege or Field Battles, use Liao's Rangers 10 times.",
  "In Siege or Field Battles, use Liao's Rangers and win 8 times.",
  "In Siege or Field Battles, use Northlander units and win 6 times.",
  "In Siege or Field Battles, use Northlander units to kill 500 troops.",
  "In Siege or Field Battles, use Shieldmaidens and get an A rating or better 10 times.",
  "In Siege or Field Battles, use Silahdars to kill 400 troops.",
  "In Siege or Field Battles, use Sipahis 9 times.",
  "In Siege or Field Battles, use Sipahis to kill 300 troops.",
  "In Siege or Field Battles, use Siphonarioi in 10 battles and get a kill/death ratio of 1 or greater.",
  "In Siege or Field Battles, use Siphonarioi in 12 battles.",
  "In Siege or Field Battles, use Siphonarioi in 5 battles and win.",
  "In Siege or Field Battles, use Siphonarioi in 8 battles and get an A ranking or better.",
  "In Siege or Field Battles, use Siphonarioi to deal 5000000 damage.",
  "In Siege or Field Battles, use Siphonarioi to kill 350 troops.",
  "In Siege or Field Battles, use Spear Sergeants to kill 300 troops.",
  "In Siege or Field Battles, use Zykalian Militia in 3 battles and win.",
  "In Siege or Field Battles, use Zykalian Militia in 6 battles and get a K/D ratio greater than 1.",
  "In Siege or Field Battles, use Zykalian Militia in 6 battles.",
  "In Siege or Field Battles, use Zykalian Militia to kill 120 troops.",
  "In Siege or Field Battles, use an Anadolou Empire unit to kill 600 troops.",
  "In Siege or Field Battles, use artillery to kill 160 troops.",
  "In Siege or Field Battles, use artillery to kill 180 troops.",
  "In Siege or Field Battles, use artillery to kill 200 troops.",
  "In Siege or Field Battles, use artillery to kill 220 troops.",
  "In Siege or Field Battles, use artillery to kill 240 troops.",
  "In Siege or Field Battles, use artillery to kill 280 troops.",
  "In Siege or Field Battles, use artillery to kill 300 troops.",
  "In Siege or Field Battles, use cavalry unit 6 times.",
  "In Siege or Field Battles, use cavalry units 9 times.",
  "In Siege or Field Battles, use cavalry units and get a K/D ratio greater than 1 10 times.",
  "In Siege or Field Battles, use cavalry units and win 6 times.",
  "In Siege or Field Battles, use charge-type skills to kill 100 troops.",
  "In Siege or Field Battles, use charge-type skills to kill 220 troops.",
  "In Siege or Field Battles, use charge-type skills to kill 80 troops.",
  "In Siege or Field Battles, use charge-type skills to kill troops 160.",
  "In Siege or Field Battles, use charge-type skills to kill troops 220 times.",
  "In Siege or Field Battles, use fireamr-wielding units to deal 8000000 damage.",
  "In Siege or Field Battles, use firearm-wielding units and win 5 times.",
  "In Siege or Field Battles, use firearm-wielding units to deal 3000000 damage.",
  "In Siege or Field Battles, use firearm-wielding units to kill 300 soldiers.",
  "In Siege or Field Battles, use pikeman units 6 times.",
  "In Siege or Field Battles, use pikeman units and win 4 times.",
  "In Siege or Field Battles, use sword infantry units 8 times.",
  "In Siege or Field Battles, use the Silahdars unit skill\nDecapitate to deal 4500000 damage.",
  "In Siege or Field Battles, use the Sipahis Croupade skill to deal 3000000 damage.",
  "In Siege or Field Battles, win 6 times.",
  "In Siege or Field Battles, you (or your group collectively) defeat 35 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 40 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 45 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 50 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 60 enemy heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 60 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 70 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 80 heroes.",
  "In Siege or Field Battles, you (or your group collectively) defeat 90 heroes.",
  "In Siege or Field Battles, you or your group collectively\nkill a total of 8 heroes in 5 battles.",
  "In Siege or Field Battles, you or your group collectively\nkills a total of 240 soldiers in 10 battles.",
  "In Siege or Field Battles, you or your group collectively\nkills a total of 240 soldiers in 6 battles.",
  "In Siege or Field Battles, you or your group collectively\nkills a total of 240 soldiers in 7 battles.",
  "In Siege or Field Battles, you or your group collectively\nkills a total of 8 heroes in 6 battles.",
  "In Siege or Field Battles, you or your group collectively\nkills a total of 8 heroes in 9 battles.",
  "In Siege or Field Battles, you or your group collectively kill a\ntotal of 240 soldiers in 6 battles.",
  "In Siege or Field Battles, you or your group collectively kills\na total of 8 heroes in 10 battles.",
  "In Siege or Field Battles, you or your group collectively kills\na total of 8 heroes in 8 battles.",
  "In Siege or Field Battles, you or your group collectively kills a\ntotal of 240 soldiers in 9 battles.",
  "In Siege or Field Battles, you or your group collectively kills a\ntotal of 8 heroes in 10 battles.",
  "In Siege or Field Battles, you or your group collectively kills a\ntotal of 8 heroes in 6 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 10 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 12 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 5 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 6 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 7 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 240 soldiers in 8 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 10 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 12 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 5 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 6 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 7 battles.",
  "In Siege or Field Battles, you or your group collectively kills a total of 8 heroes in 8 battles.",
  "In Siege or Field Battles, you or your group members get 20 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 25 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 30 rankings of A+ or better.",
  "In Siege or Field Battles, you or your group members get 30 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 30 ratings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 35 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 40 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 45 ranking of B+ or better.",
  "In Siege or Field Battles, you or your group members get 45 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 50 rankings of B+ or better.",
  "In Siege or Field Battles, you or your group members get 60 rankings of B+ or better.",
  "In Siege or Field Battles, your Tower Shield or Shield & Spear\nunits take 9000000 damage.",
  "In Siege or Field Battles, your eastern spearmen take 9000000 damage.",
  "In Siege or Field Battles, your spearmen take 6000000 damage.",
  "In Siege or Field Battles, your spearmen take 9000000 damage.",
  "In Siege or Field Battles,earn 40 capture points or interrupt a capture in 7 battles.",
  "In Siege or Free Battles, win 6 times.",
  "In Territory Wars, take 4-star or better units into battle 4 times.",
  "In Territory Wars, take sword units into battle 4 times.",
  "In an Expedition, inflict a total of 10000000 damage.",
  "In any battle, earn 50 of any kind of badge, or 10 silver or better badges.",
  "In any battle, earn 80 of any kind of badge, or 25 silver or better badges.",
  "In any battle, get a Troop Kill Score of 3000.",
  "In any battle, get a Troop Kill Score of 5000.",
  "In any battle, get a Troop Kill score of 3000.",
  "In any mode, use the Sons of Fenrir and get an A ranking or better 10 times.",
  "Inflict a total of 10000000 damage during an Expedition.",
  "Inflict a total of 5000000 damage during an Expedition.",
  "Inflict a total of 5000000 damage while on an Expedition.",
  "Join 10 Deathmatches or get the \"Quad Kill\" badge 9 times in Field or Siege battles of any type.",
  "Join 10 Deathmatches or win 10 Field or Siege Battles of any type.",
  "Join 10 Deathmatches or win 10 Field or Siege battles.",
  "Join 10 Free Battles or win 10 Field or Siege Battles of any type.",
  "Join 10 Ranked Battles or win 10 Field or Siege Battles of any type.",
  "Join 10 Territory Wars.",
  "Join 5 Deathmatches or kill 12 heroes in Field or Siege Battles.",
  "Join 6 Deathmatches or get ranked in top 5 8 times in Field or Siege Battles.",
  "Join 6 Deathmatches or win 5 Field or Siege Battles.",
  "Join 6 Free Battles or win 6 Field or Siege Battles of any type.",
  "Join 6 Free Battles, or deploy 15 artillery in Field or Siege Battles.",
  "Join 6 Free Battles.",
  "Join 7 Deathmatches or win 7 Field or Siege Battles of any type.",
  "Join 7 Free Battles or win 5 Field or Siege Battles.",
  "Join 7 Free Battles or win 5 Field or Siege battles.",
  "Join 7 Free Battles.",
  "Join 7 Ranked Battles or win 5 Field or Siege battles.",
  "Join 7 Ranked Battles or win 7 Field or Siege Battles of any type.",
  "Join 8 Deathmatches or win 10 Field or Siege Battles of any type.",
  "Join 8 Free Battles or win 8 Field or Siege Battles of any type.",
  "Join 8 Free Battles.",
  "Join 8 Ranked Battles or win 8 Field or Siege Battles of any type.",
  "Join 8 Territory Wars.",
  "Join 9 Deathmatches or get 7 \"No Quarter\" badges in Field or Siege Battles of any type.",
  "Join 9 Free Battles or win 7 Field or Siege battles.",
  "Join Free Battle 12 times.",
  "Join Free Battle 5 times.",
  "Join Free Battle 6 times.",
  "Join a total of 4 Deathmatches.",
  "Join a total of 5 Deathmatches.",
  "Join a total of 6 Deathmatches or complete 15 Fief Quests.",
  "Kick over 12 ladders put up by the enemy.",
  "Kick over 15 ladders put up by the enemy.",
  "Kick over 8 ladders put up by the enemy.",
  "Kill 10 heroes in Deathmatch.",
  "Kill 10 heroes in deathmatch.",
  "Kill 10 players in Deathmatch.",
  "Kill 1000 enemy players using Shenji Grenadiers in any mode.",
  "Kill 12 heroes in Deathmatch.",
  "Kill 12 heroes in Deathmatches or use artillery to kill 160 soldiers in Field or Siege Battles.",
  "Kill 15 heroes in Deathmatch.",
  "Kill 20 heroes in Deathmatch.",
  "Kill 20 heroes in Ranked Battles.",
  "Kill 200 soldiers in a single battle in any mode 10 times.",
  "Kill 200 soldiers in a single battle in any mode 3 times.",
  "Kill 25 enemy heroes in Deathmatch, or earn 5 \"No Quarter\" badges in Field or Siege Battles of any type.",
  "Kill 260 soldiers using Siphonarioi in Ranked Battles.",
  "Kill 30 enemy heroes in Deathmatch, or earn 4 \"No Quarter\" badges.",
  "Kill 30 enemy heroes in Deathmatch, or earn 6 \"No Quarter\" badges in Field or Siege Battles of any type.",
  "Kill 30 enemy heroes or earn 6 \"No Quarter\" badges.",
  "Kill 30 enemy heroesi n Deathmatch, or earn 6 \"No Quarter\" badges in Field or Siege Battles of any type.",
  "Kill 300 enemy troops using Shenji Grenadiers in any mode.",
  "Kill 300 soldiers using Siphonarioi in Free Battles.",
  "Kill 450 soldiers in Ranked Battles.",
  "Kill 5 heroes per battle, or destroy or deploy an artillery piece, in 6 Field or Siege battles.",
  "Kill 700 soldiers using Siphonarioi in Expeditions.",
  "Knock over a ladder or acquire 15 capture points in 10 Field or Siege Battles of any type.",
  "Knock over a ladder or acquire 15 capture points in 5 Field or Siege Battles of any type.",
  "Knock over a ladder or acquire 15 capture points in 7 Field or Siege Battles of any type.",
  "Knock over a siege ladder or acquire 15 capture points 5 Field or Siege battles.",
  "Knock over a siege ladder or acquire 15 capture points in 10 Field or Siege battle of any type.",
  "Knock over a siege ladder or acquire 15 capture points in 10 Field or Siege battles.",
  "Knock over a siege ladder or acquire 15 capture points in 7 Field or Siege battles.",
  "Knock over a siege ladder or acquire 15 capture points in 8 Field or Siege battle of any type.",
  "Knock over a siege ladder or acquire 15 capture poitns in 10 Field or Siege battle of any type.",
  "Level up your hero 5 times.",
  "Push a siege tower to the ramparts or destroy a siege engine in 10 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 4 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 5 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 6 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 7 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 8 Siege Battles.",
  "Push a siege tower to the ramparts or destroy a siege engine in 9 Siege Battles.",
  "Raise you hero up 6 Levels.",
  "Raise your hero 10 levels.",
  "Raise your hero 12 levels.",
  "Raise your hero 3 levels.",
  "Raise your hero 6 levels.",
  "Raise your hero 8 levels.",
  "Raise your hero up 10 Levels.",
  "Raise your hero up 10 levels.",
  "Raise your hero up 12 Levels.",
  "Raise your hero up 12 levels.",
  "Raise your hero up 15 Levels.",
  "Raise your hero up 5 Levels.",
  "Raise your hero up 8 Levels.",
  "Raise your hero up 8 levels.",
  "Raise your season level by 6.",
  "Rank in the top 5 in 9 Free Battles, or deploy 15 artillery in Field or Siege Battles.",
  "Rarn 5 \"No Quarter\" badges.",
  "Rise your hero up 10 levels.",
  "Seach 25 loot sites in the open world.",
  "Search 10 loot sites in the open world.",
  "Search 12 loot sites in the open world.",
  "Search 15 loot sites in the open world.",
  "Search 20 loot sites in the open world.",
  "Search 25 loot sites in the open world.",
  "Search 30 loot sites in the open world.",
  "Search 40 loot sites in the open world.",
  "Take Axe Raiders into a Siege or Field battle 7 times.",
  "Take Azaps into 5 Siege or Field battles and win.",
  "Take Azaps into Expeditions 9 times and win.",
  "Take Azaps into a Siege or Field battle 9 times and get a kill/death ratio greater than 1.",
  "Take Berserkers into 8 Siege or Field battles.",
  "Take Cudgel Monks into a Siege or Field battle 6 times.",
  "Take Janissaries into 6 Free Battles.",
  "Take Men-at-Arms into Expeditions 8 times.",
  "Take Men-at-Arms into Expeditions and get an A+ ranking or better 7 times.",
  "Take Men-at-Arms into a Siege or Field battle 9 times.",
  "Take Men-at-Arms into a Siege or Field battle and get a kill/death ratio greater than 1 8 times.",
  "Take Men-at-Arms into a Siege or Field battle and win 5 times.",
  "Take Modao Battalion into a Siege or Field battle 10 times.",
  "Take Part in 7 Territory Wars.",
  "Take Shenji Grenadiers into a Siege or Field battle 10 times.",
  "Take Shieldmaidens into 10 Free Battles and get an A rating or better.",
  "Take Shieldmaidens into 10 Ranked Battles and get a K/D ratio greater than 1.",
  "Take Shieldmaidens into 6 Free Battles and win.",
  "Take Shieldmaidens into 6 Ranked Battles and win.",
  "Take Shieldmaidens into a Siege or Field battle 12 times.",
  "Take Spear Sergeants into Expeditions 8 times.",
  "Take Spear Sergeants into a Siege or Field battle 8 times.",
  "Take Spear Sergeants into a Siege or Field battle and win 4 times.",
  "Take Steppe units into any PvP battle and deal 3000000 damage.",
  "Take Steppe units into battle and get a kill/death ratio of greater than 1 on 5 occasions.",
  "Take a Shortsword & Shield unit into a Siege or Field Battle 7 times.",
  "Take a firearm unit into 5 Siege battles.",
  "Take a pike unit into a Siege or Field battle 10 times.",
  "Take a pike unit into a Siege or Field battle and win 6 times.",
  "Take a sword infantry unit into a Siege or Field battle 6 times and win.",
  "Take a sword infantry unit into a Siege or Field battle 7 times.",
  "Take a sword infantry unit into a Siege or Field battle and win 3 times.",
  "Take four units from different eras into a Siege or Field battle 10 times.",
  "Take part in 10 Territory War battles.",
  "Take part in 10 Territory Wars.",
  "Take part in 4 Territory Wars.",
  "Take part in 5 Territory Wars.",
  "Take part in 6 Territory War Battles.",
  "Take part in 6 Territory War battles.",
  "Take part in 6 Territory Wars.",
  "Take part in 7 Territory Wars.",
  "Take part in 8 Territory War Battles.",
  "Take part in 8 Territory War battles.",
  "Take part in 8 Territory Wars.",
  "Take the Greyhair Garrison into 7 Ranked Battles and get a kill/death ratio greater than 1.5.",
  "Take the Greyhair Garrison into Expeditions and get an A+ ranking or better 7 times.",
  "Take the Sons of Fenrir into a Siege or Field battle and win 4 times.",
  "Take three or more units from different eras into a Siege or Field battle 5 times.",
  "Take three or more units from different eras into a Siege or Field battle 6 times.",
  "Through Siege Battles, Field Battles, or Expeditions, earn 120 badges.",
  "Upgrade a Hero 5 levels.",
  "Upgrade a Hero 8 levels.",
  "Use Alchemists in 5 Field or Siege Battles os any type.",
  "Use Bagpipers in 6 Field or Siege battles.",
  "Use Banner Guards and win 8 Expeditions.",
  "Use Banner Guards to kill 300 enemy soldiers in Field or Siege Battles of any type.",
  "Use Berserkers and get a kill/death ratio of 4 or greater in 6 ranked battles or in 12 Siege or Field battles.",
  "Use Camel Lancers and kill 100 soldiers in Field or Siege battles.",
  "Use Camel Lancers and win 12 Expeditions or Bandit Raids.",
  "Use Chevaliers and get a Troop Kill Score of 300 or better in 8 Free Battles, or use this unit and get a Troop Kill Score of 400 or greater in 8 Field or Siege Battles of any type.",
  "Use Chevaliers and get a Troop Kill Score of 400 or better in 8 Ranked Battles.",
  "Use Chevaliers and win 10 Expeditions.",
  "Use Chevaliers and win 5 Field or Siege Battles of any type.",
  "Use Chevaliers and win 7 Ranked Battles.",
  "Use Chevaliers in 10 Field or Siege Battles of any type.",
  "Use Claymores and get a Troop Kill Score of 300 or more in 7 Field or Siege battles.",
  "Use Claymores and get a kill/death ratio of 1.5 or more in 7 Field or Siege battles.",
  "Use Crescent Monks and win 10 PvE Battles (excluding Training Battle).",
  "Use Cudgel Monks in 6 Ranked Battles.",
  "Use Cudgel Monks to win 3 Free Battles.",
  "Use Cudgel Monks to win 6 Expeditions.",
  "Use Dimachaeri and win 8 PvE Battles (excluding Training Battle).",
  "Use Empyrean or Symmachean units in 10 Siege or Field battles.",
  "Use Empyrean or Symmachean units to kill 1000 soldiers in Expeditions.",
  "Use Greyhair Garrison in 7 Expeditions.",
  "Use Hashashins and get a Troop Kill score of 300 or higher in 8 Field or Siege Battles of any type.",
  "Use Hashashins to defeat 300 troops during Expeditions or Bandit Raids.",
  "Use Hashashins to kill 15 heroes in Field or Siege battles.",
  "Use Houndsmen and win 10 Expeditions.",
  "Use Houndsmen and win 10 Field or Siege battles.",
  "Use Houndsmen and win 5 Free Battles, or get a Troop Kill Score of 1000 or greater in 8 Field or Siege battles.",
  "Use Houndsmen in 10 Field or Siege battles.",
  "Use Houndsmen in 10 Ranked Battles.",
  "Use Houndsment to kill 200 enemy soldiers in Field or Siege battles.",
  "Use Huskarls and win 5 Field or Siege battles of any type.",
  "Use Huskarls to attack 10 Rebel Camps of any difficulty and win.",
  "Use Kriegsbruders and win 8 Expeditions.",
  "Use Kriegsbruders to attack 8 Rebel Camps of any difficulty and win.",
  "Use Liao's Rangers and get a kill/death ratio of greater than 1 in 10 ranked battles or 20 Field or Siege battles.",
  "Use Modao Battalion in 7 Ranked Battles.",
  "Use Modao Battalion to win 4 Ranked Battles.",
  "Use Modao Battalion to win 7 Expeditions.",
  "Use Myrmillones and get a Troop Kill score of 200 or higher in 10 Field or Siege Battles of any type.",
  "Use Myrmillones and kill 600 enemy soldiers in Expeditions or Bandit Raids.",
  "Use Myrmillones and kill 600 enemy soldiers in PvE battles (excluding Training Battle).",
  "Use Northlander units in 10 Ranked Battles.",
  "Use Northlander units in 5 Ranked Battles and win.",
  "Use Onna-mush and win 8 PvE Battles (excluding Training Battle and Deploy & Defend).",
  "Use Orochi Samurai and get a Troop Kill score of 300 or higher in 10 Field or Siege Battles of any type.",
  "Use Orochi Samurai and win 10 Field or Siege battles.",
  "Use Orochi Samurai and win 10 PvE Battles (excluding Training Battle and Deploy & Defend).",
  "Use Perceval’s Royal Guards and win 8 PvE Battles (excludes Training Battles).",
  "Use Queen's Knights and win 10 PvE Battles (excluding Training Battle).",
  "Use Ronin and win 6 PvE Battles (excluding Training Battle and Deploy & Defend).",
  "Use Schutzdieners and win 6 Field or Siege battles.",
  "Use Shenji Grenadiers and win 5 ranked battles or 10 Siege or Field Battles",
  "Use Shenji Grenadiers in 10 Free Battles.",
  "Use Shenji Grenadiers in 5 Free Battles and win.",
  "Use Shenji Grenadiers in 5 Ranked Battles and win.",
  "Use Sipahis in, and win, 3 Free Battles.",
  "Use Siphonarioi and get a kill/death ratio of 1 or greater in 8 ranked battles or in 16 Siege or Field battles.",
  "Use Siphonarioi to kill 260 enemy soldiers in ranked battles or 520 enemy soldiers in Siege or Field battles.",
  "Use Varangian Guards and win 5 Field or Siege battles of any type.",
  "Use Varangian Guards to attack 10 Rebel Camps of any difficulty and win.",
  "Use Varangian Guards to kill 200 enemy soldiers while using Raging Onslaught in Field or Siege battles.",
  "Use Wuwei Mansion Guards and get a Troop Kill score of 300 or higher in 8 Field or Siege Battles of any type.",
  "Use Wuxing Pikemen and get a Troop Kill score of 200 or higher in 6 Field or Siege Battles of any type.",
  "Use Yanyuedao Cavalry and get a Troop Kill score of 200 or higher in 10 Field or Siege Battles of any type.",
  "Use Yanyuedao Cavalry and get a Troop Kill score of 300 or higher in 10 Field or Siege Battles of any type.",
  "Use Yanyuedao Cavalry and win 12 PvE Battles (excluding Training Battle).",
  "Use Zweihanders and get a Troop Kill score of 300 or higher in 10 Field or Siege Battles of any type.",
  "Use Zweihanders and win 10 Raider Camps or Bandit Raids.",
  "Use Zweihanders to attack 10 Rebel Camps of any difficulty and win.",
  "Use [Companion Cavalry] and get a Troop Kill score of 300 or higher in 8 Field or Siege Battles of any type.",
  "Use [Psiloi Slingers] and get a Troop Kill score of 300 or higher in 5 Field or Siege Battles of any type.",
  "Use a trebuchet or interrupt a capture 10 times in Field or Siege Battles of any type.",
  "Use a trebuchet or interrupt a capture 6 times in Field or Siege battles.",
  "Use a trebuchet or interrupt a capture 8 times in Field or Siege Battles of any type.",
  "Use a trebuchet or interrupt a capture in 10 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 12 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 13 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 6 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 7 Field or Siege battles.",
  "Use a trebuchet or interrupt a capture in 7 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 8 Siege Battles.",
  "Use a trebuchet or interrupt a capture in 9 Siege Battles.",
  "Use a trebuchet or knock down a ladder in 5 battles in any mode.",
  "Use a trebuchet or knock down a ladder in 8 battles in any mode.",
  "Use a trebuchet or knock over a ladder in 10 Siege Battles.",
  "Use a trebuchet or knock over a ladder in 5 Siege Battles.",
  "Use a trebuchet or knock over a ladder in 6 Siege Battles.",
  "Use artillery to kill 100 soldiers or 6 heroes in Field or Siege Battles of any type.",
  "Use artillery to kill 120 soldiers or 6 heroes in Field or Siege Battles.",
  "Use artillery to kill 130 soldiers or 8 heroes in Field or Siege Battles of any type.",
  "Use artillery to kill 160 soldiers or 10 heroes in Field or Siege Battles of any type.",
  "Use artillery to kill 160 soldiers or 10 heroes in Field or Siege Battles.",
  "Use artillery to kill 160 soldiers or 10 heroesi n Field or Siege Battles of any type.",
  "Use artillery to kill 160 troops in any kind of battle.",
  "Use artillery to kill 200 soldiers or 12 heroes in Field or Siege Battles of any type.",
  "Use artillery to kill 30 soldiers or 2 heroes in 10 Field or Siege Battles of any type.",
  "Use artillery to kill 30 soldiers or 2 heroes in 6 Field or Siege Battles of any type.",
  "Use artillery to kill 30 soldiers or 2 heroes in 8 Field or Siege Battles of any type.",
  "Use artillery to kill 30 soldiers or 2 heroes in 8 Fields or Siege Battles of any type.",
  "Use firearm units in 9 Ranked Battles.",
  "Use firearm units to win 9 Expeditions.",
  "Use four infantry units from different eras in a Siege or Field battle 10 times.",
  "Use four unit from different eras in a Siege or Field battle 7 times.",
  "Use four units from different eras in Siege or Field battle 10 times.",
  "Use four units from different eras in a Siege or Field battle 10 times and win.",
  "Use four units from different eras in a Siege or Field battle 12 times and win.",
  "Use four units from different eras in a Siege or Field battle 5 times and win.",
  "Use four units from different eras in a Siege or Field battle 6 times and win.",
  "Use four units from different eras in a Siege or Field battle 8 times.",
  "Use four units from different eras in a Siege or Field battle 9 times.",
  "Use tebuchets 8 times.",
  "Use the Chevaliers skill \"Assault\" to kill 200 troops in Field or Siege Battles of any type.",
  "Use the Greyhair Garrison and get a kill/death ratio of greater than 1.5 in 7 Ranked Battles or 14 Field or Siege Battles.",
  "Use the Greyhair Garrison in 7 Field or Siege Battles.",
  "Use the Hashashins skills Prowl or Eviscerate to kill 200 enemy soldiers in any type of Field or Siege battles.",
  "Use the Modao Battalion unit and win 4 ranked battles or 8 Field or Siege Battles.",
  "Use the Sons of Fenrir to win 6 expeditions.",
  "Use three or more units from different eras in a Siege or Field battle 7 times.",
  "Use trebuchets 10 times.",
  "Using Axe Raiders, achieve victory in 7 Raider Camps or Bandit Raids.",
  "Using Crescent Monks, win 8 Raider Camps or Bandit Raids.",
  "Using Hashashin, win 10 Raider Camps or Bandit Raids.",
  "Using Huskarls, win 10 Raider Camps or Bandit Raids.",
  "Using Landsknechts, achieve victory in 6 Raider Camps or Bandit Raids.",
  "Using Liao's Rangers, achieve victory in 10 Raider Camps or Bandit Raids.",
  "Using Outriders, achieve victory in 6 Raider Camps or Bandit Raids.",
  "Using Retiarii, attack 10 Rebel Camps of any difficulty and win.",
  "Using Siphonariai, achieve victory in 10 Raider Camps or Bandit Raids.",
  "Using Zykalian Militia, achieve victory in 5 Raider Camps or Bandit Raids.",
  "Win 10 Deathmatches or get 5 \"No Quarter\" badges in any PVP mode.",
  "Win 10 Expeditions using Shieldmaidens.",
  "Win 10 Expeditions.",
  "Win 15 Expeditions.",
  "Win 2 Deathmatches.",
  "Win 2 Free Battles.",
  "Win 3 Deathmatches",
  "Win 3 Deathmatches or earn Grand Bloodbath badges in any mode 10 times.",
  "Win 3 Deathmatches or win 5 Field or Siege Battles.",
  "Win 3 Deathmatches.",
  "Win 3 Field or Siege Battles in a row or win 5 times.",
  "Win 3 Field or Siege Battles in a row or win 6 times.",
  "Win 3 Field or Siege battles in a row or join 8 Field or Siege battles.",
  "Win 3 Free Battles using the Greyhair Garrison.",
  "Win 3 Free Battles.",
  "Win 4 Deathmatches or complete 15 Fief Quests.",
  "Win 4 Deathmatches or get an S or better ranking in 5 Field or Siege Battles.",
  "Win 4 Deathmatches.",
  "Win 4 Field or Siege Battles using the Greyhair Garrison.",
  "Win 4 Field or Siege Battles.",
  "Win 4 Free Battles or complete 15 Fief Quests.",
  "Win 4 Free Battles or join 8 Territory Wars.",
  "Win 4 Free Battles.",
  "Win 4 Ranked Battles.",
  "Win 4 Territory Wars.",
  "Win 5 Deathmatches or earn Grand Bloodbath badges in any mode 10 times.",
  "Win 5 Deathmatches or get an A+ rating or better in 10 Expeditions.",
  "Win 5 Deathmatches.",
  "Win 5 Expeditions.",
  "Win 5 Field or Siege Battles.",
  "Win 5 Free Battles",
  "Win 5 Free Battles or defeat 1500 troops during Expeditions.",
  "Win 5 Free Battles.",
  "Win 5 Ranked Battles.",
  "Win 6 Deathmatches.",
  "Win 6 Expeditions.",
  "Win 6 Field or Siege Battles.",
  "Win 6 Free Battles.",
  "Win 6 Ranked Battles.",
  "Win 7 Deathmatches",
  "Win 7 Deathmatches.",
  "Win 7 Expeditions or Bandit Raids.",
  "Win 7 Expeditions.",
  "Win 7 Field or Siege Battles.",
  "Win 7 Free Battles.",
  "Win 8 Deathmatches.",
  "Win 8 Expeditions.",
  "Win 8 Field or Siege Battles.",
  "Win 9 Expeditions.",
  "Win a total of 2 Deathmatches.",
  "You or your grouip collectively kills a total of 240 soldiers in 10 Field or Siege Battles of any type.",
  "You or your group collectively kills a total fo 240 soldiers in 6 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers 10 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 10 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 10 Field or Siege battles.",
  "You or your group collectively kills a total of 240 soldiers in 6 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 6 Field or Siege battles.",
  "You or your group collectively kills a total of 240 soldiers in 7 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 7 Field or Siege battles.",
  "You or your group collectively kills a total of 240 soldiers in 8 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 8 Field or Siege Battles or any type.",
  "You or your group collectively kills a total of 240 soldiers in 9 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 240 soldiers in 9 Field or Siege battles.",
  "You or your group collectively kills a total of 240 soldiers in Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 10 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 10 Field or Siege battles.",
  "You or your group collectively kills a total of 8 heroes in 5 Field or Siege battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 6 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 6 Field or Siege battles.",
  "You or your group collectively kills a total of 8 heroes in 7 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 7 Field or Siege battles.",
  "You or your group collectively kills a total of 8 heroes in 8 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 9 Field or Siege Battles of any type.",
  "You or your group collectively kills a total of 8 heroes in 9 Field or Siege battles.",
  "You or your group collectively kills a total of 8 heroes in6 Field or Siege Battles of any type.",
  "You or your group members get 10 A+ or better ratings in Field or Siege Battles of any type.",
  "You or your group members get 15 A+ or better rankings in Field or Siege Battles of any type.",
  "You or your group members get 15 A+ or better ratings in Field or Siege Battles of any type.",
  "You or your group members get 20 A+ or better rankings in Field or Siege Battles of any type.",
  "You or your group members get 20 A+ or better ratings in Field or Siege Battles of any type.",
  "You or your group members get 20 A+ or better ratings in Field or Siege Battles of anyt type.",
  "You or your group members get 20 A+ or better ratings in Field or Siege Battles or Siege Battles of any type.",
  "You or your group members get 25 A+ or better randkings in Field or Siege Battles of any type.",
  "You or your group members get 25 A+ or better rankings in Field or Siege battles.",
  "You or your group members get 25 A+ or better rankings or 8 S rating in Field or Siege battles.",
  "You or your group members get 25 A+ or better rankings or 8 S ratings in Field or Siege battles.",
  "You or your own group collectively kills a total of 8 heroes in 10 Field or Siege Battles of any type.",
  "Your Empyrean or Symmachean units get a K/D ratio higher than 1 in 10 Siege or Field battles.",
  "Your Houndsmen get a kill/death ratio 0.8 or better in 10 Field or Siege battles.",
  "Your Houndsmen get a kill/death ratio of 0.8 or better in 10 Field or Siege battles.",
  "Your Houndsmen get a kill/death ratio of 0.8 or greater in 10 Free Battles, or they get a Troop Kill Score of 400 or greater in 8 Field or Siege battles.",
  "Your Houndsmen get a kill/death ratio of 0.8 or greater in 8 Ranked Battles.",
  "Your Houndsmen geta kill/death ratio of 0.8 or greater in 8 Ranked Battles.",
  "get a Troop Kill Score of 1000 or higher in 6 Field or Siege Battles of any type.",
  "kill 300 soldiers using Empyrean or Symmachean units in Ranked Battles.",
  "use Huskarls and get a Troop Kill score of 200 or higher in 8 Field or Siege battles.",
  "use Myrmillones and kill 200 soldiers in Field or Siege Battles of any type.",
  "use Retiarii and win 10 PvE battles (excluding Training Battle).",
  "use three or more units from different eras in a Siege or Field battle 8 times.",
  "you or your group collectively kills a total of 240 soldiers in 10 Field or Siege Battles of any type.",
  "you or your group collectively kills a total of 8 heroes in 10 Field or Siege Battles of any type."
]
